Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>libp2p</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.this["blog"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = "master"
      + delete_branch_on_merge = false
      + description            = "Blog site for the libp2p project."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "blog"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "type-website",
        ]
      + visibility             = "public"
    }

  # github_repository_collaborator.this["blog:p-shahi"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "blog"
      + username                    = "p-shahi"
    }

  # github_repository_file.this["blog/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
              - cron: '0 0 * * *'
            
            jobs:
              stale:
            
                runs-on: ubuntu-latest
                permissions:
                  issues: write
                  pull-requests: write
            
                steps:
                - uses: actions/stale@v3
                  with:
                    repo-token: ${{ secrets.GITHUB_TOKEN }}
                    stale-issue-message: 'Oops, seems like we needed more information for this issue, please comment with more details or this issue will be closed in 7 days.'
                    close-issue-message: 'This issue was closed because it is missing author input.'
                    stale-issue-label: 'kind/stale'
                    any-of-labels: 'need/author-input'
                    exempt-issue-labels: 'need/triage,need/community-input,need/maintainer-input,need/maintainers-input,need/analysis,status/blocked,status/in-progress,status/ready,status/deferred,status/inactive'
                    days-before-issue-stale: 6
                    days-before-issue-close: 7
                    enable-statistics: true
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "blog"
      + sha                 = (known after apply)
    }

  # github_team_repository.this["Admin:blog"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "blog"
      + team_id    = "2077192"
    }

  # github_team_repository.this["Repos - Go:blog"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "blog"
      + team_id    = "2100801"
    }

  # github_team_repository.this["Repos - JavaScript:blog"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "blog"
      + team_id    = "2120753"
    }

  # github_team_repository.this["Repos - Rust:blog"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "blog"
      + team_id    = "2457482"
    }

  # github_team_repository.this["ci:blog"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "blog"
      + team_id    = "2562372"
    }

  # github_team_repository.this["docs:blog"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "blog"
      + team_id    = "5688138"
    }

  # github_team_repository.this["go-libp2p Maintainers:blog"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "blog"
      + team_id    = "5253535"
    }

  # github_team_repository.this["rust-libp2p Maintainers:blog"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "blog"
      + team_id    = "6797340"
    }

  # github_team_repository.this["w3dt-stewards:blog"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "blog"
      + team_id    = "4657013"
    }

Plan: 12 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->